const axios = require("axios");
const request = require("request");
const fs = require("fs-extra");

const ZiaRein3 = `●═══════❍═══════●\nالــصَـداقَــة هِــي أنْ تَــذهَـبْ وَتَــعُـود وَتَــجــد لِــ نَــفــسَـكْ “ مَــكـانـاً ” بِـيـنَـهُـمْ
قواعد وشروط الجروب♥
1-احترام آراء الآخرين وعدم التلفظ بألفاظ تخدش الحياء
2- الحفاظ على القيم والعادات والتقاليد
3- الحفاظ على تعاليم الدين الاسلامي
4- المرجو التعامل مع المنشورات الجديه بكل حزم وجد والمنشورات الاخرى
يتعامل فيها كل عضو بمايريد مع العلم ان التعليق يعبر عن شخصيتك
5 - عدم وضع صور إباحية ومثيرة جدا وذلك تفاديا لإثارة المشاكل من قبل بعض
الأعضاء
6- عدم إزعاج البنات بطلبات الأضافة داخل الجروب أو الرسائل غير
اللائقة.....يتم تنبيه العضو لمره واحده واذا لم يستجب العضو المعني يحذف
على الفور
7- عدم نشر اي صفحه او جروب فيNever Back Down
تنبيه العضو لمره واحده واذا لم يستجب العضو المعني يحذف على الفور
8- التشهير والتشويه لعضو ما او إنسان ما ؟ داخل الجروب يمنع منعا باتا
ويتحمل صاحب الموضوع الجزاء وهوا الحذف النهائي
9- يرجى عدم نشر المنشورات السياسية لكافة الدول العربية و اى عضو سينشر اى
منشور سياسى سيتم تحذيره مرة واحدة و بعد ذلك سيتم طرد العضو
10- أرجو الابلاغ فوراً عن أي شيء مخالف داخل الجروب
11- ممنوع نشر الصور الشخصيه على الجروب او كتابه ارقام الهواتف الخاصه بكم
11_السياسه ممنوعه منعا باتا ..................... وبكرر منمنوع السياسه
منعا باتا
12_ اى شاب يحاول الدخول باسم بنت مصيره #الطرد
.......اي شخص يسيء للجروب سيتم حظره
...... ? فأتمنى أن نبقى اخوة ? .....
لن نجبر أحداً على دخول المجموعة ولا على البقاء فيها !!!
ولكني ألتمس من الموجودين فيها إحترام قوانينها.
المجموعه منكم ولكم وانتم من يتصرف بمجريات الامور وكلنا تقة فيكم
ارجوا من الجميع الالتزام ولكم خالص الشكر والتقدير على التعاون
Admins\n●═══════❍═══════●`;

const ZiaRein = [
  "https://i.imgur.com/huumLca.jpg",
  "https://i.imgur.com/EcryTGh.jpg",
  "https://i.imgur.com/tu12HrQ.jpg",
  "https://i.imgur.com/Vx25FHG.jpg",
  "https://i.imgur.com/NcbC8Pn.jpg",
];

const ZiaRein2 = (api, event) => {
  api.sendMessage({ body: ZiaRein3, attachment: fs.createReadStream(process.cwd() + "/cache/ZiaRein1.jpg") }, event.threadID, () => {
    fs.unlinkSync(process.cwd() + "/cache/ZiaRein1.jpg");
  }, event.messageID);
};

const execute = async ({ api, event }) => {
  return request(encodeURI(ZiaRein[Math.floor(Math.random() * ZiaRein.length)]))
    .pipe(fs.createWriteStream(process.cwd() + "/cache/ZiaRein1.jpg"))
    .on("close", () => ZiaRein2(api, event));
};

export default {
  name: "قواعد",
  author: "Hussein Yacoubi",
  role: "member",
  description: "Sends a random image with group rules.",
  execute,
};
